"""
4. Створiть 3 рiзних функцiї (на ваш вибiр). Кожна з цих функцiй повинна повертати якийсь результат. 
Також створiть четверу ф-цiю, яка в тiлi викликає 3 попереднi, 
обробляє повернутий ними результат та також повертає результат. 
Таким чином ми будемо викликати 1 функцiю, а вона в своєму тiлi ще 3
"""

def plus(a, b):
    return a + b

def minus(a, b):
    return a - b

def maximum(a, b):
    return max(a, b)

def caller(a, b):
    print('Сума: ', plus(a, b))
    print('Різниця: ', minus(a, b))
    print('Найбільше число: ', maximum(a, b))

a, b = map(int, input('Введіть через кому два числа: ').split(', '))

caller(a, b)
