"""
5. Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
-  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї),
пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" 
і при нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.

-  Повиннi опрацювати такi умови:
-  x > y;       вiдповiдь - х бiльше нiж у на z
-  x < y;       вiдповiдь - у бiльше нiж х на z
-  x == y.      вiдповiдь - х дорiвнює z
"""

def x_bigger(x, y):
    print('x більше ніж у на',x - y)

def y_bigger(x, y):
    print('y більше ніж x на',y - x)

def equal(x, y):
    print('x дорівнює у')

def check(x, y):
    if x > y:
        x_bigger(x, y)
    elif x < y:
        y_bigger(x, y)
    else:
        equal(x, y)

x, y = map(int, input('Введіть Х і Y через кому: ').split(', '))

check(x, y)
