"""
2. Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів.
   На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу.
   Кількість символів в блоках - та, яка введена в другому параметрі.
   Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі (наприклад, файл із двох символів і треба вивести по одному символу, то що виводити на місці середнього блоку символів?)
   В репозиторій додайте і ті файли, по яким робили тести.
   Як визначати середину файлу (з якої брать необхідні символи) - кількість символів поділити навпіл, а отримане "вікно" символів відцентрувати щодо середини файла і взяти необхідну кількість. В разі необхідності заокруглення одного чи обох параметрів - дивіться на свій розсуд.
   Наприклад:
   █ █ █ ░ ░ ░ ░ ░ █ █ █ ░ ░ ░ ░ ░ █ █ █    - правильно
                     ⏫ центр
   █ █ █ ░ ░ ░ ░ ░ ░ █ █ █ ░ ░ ░ ░ █ █ █    - неправильно
                     ⏫ центр
"""


def selector(filename, symbol_num):
    try:
        with open(filename, 'rt') as file:
            string = str(file.read())

            if len(string) >= 3 * symbol_num:
                start_block = string[0:symbol_num]
                end_block = string[len(string) - symbol_num:len(string)]
                center_block = string[
                               int(0.5 * len(string) - 0.5 * symbol_num):int(0.5 * len(string) + 0.5 * symbol_num)]

                return start_block, center_block, end_block
            else:
                return 'Введіть правильну кількість символів.'
    except FileNotFoundError:
        print('Введіть дійсну назву файлу.')

number = int(input('Введіть к-ть символів: '))
filename = input('Введіть назву файлу: ')

print(selector(filename, number))
